gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
/**
 * @file watchdog.c
 * @author Gian Barta-Dougall ()
 * @brief
 * @version 0.1
 * @date 2023-01-30
 *
 * @copyright Copyright (c) 2023
 *
 */

/* C Library Includes */
#include <stdio.h>

/* Personal Includes */
#include "watchdog.h"
#include "ds18b20.h"
#include "hardware_config.h"
#include "log.h"
#include "comms_stm32.h"
#include "utilities.h"
#include "chars.h"
#include "help.h"
#include "stm32_rtc.h"
#include "watchdog_defines.h"

/* Private Macros */
#define ESP32_UART BUFFER_1_ID
#define MAPLE_UART BUFFER_2_ID
#define DEBUG

#define S0_READ_WATCHDOG_SETTINGS 1
#define S1_INIT_RTC               3
#define S2_SET_ALARM              4
#define S3_STM32_SLEEP            5
#define S4_RECORD_DATA            6
#define S5_SET_RTC_ALARM          7
#define S6_CHECK_INCOMING_REQUEST 8
#define S7_EXECUTE_REQUEST        9
#define S8_START_COUNT_DOWN       10
#define S9_STM32_WAKE             11

#define TIMEOUT         5000
#define COUNT_DOWN_TIME 60000

/* Private Variables */
dt_datetime_t datetime;
bpacket_t mapleBpacket, esp32Bpacket;
uint8_t state    = S0_READ_WATCHDOG_SETTINGS;
uint8_t sleeping = FALSE;

wd_settings_t wdSettings = {
    .cameraSettings.resolution    = WD_CAM_RES_640x480,
    .captureTime.startTime.second = 0,
    .captureTime.startTime.minute = 0,
    .captureTime.startTime.hour   = 9,
    .captureTime.endTime.second   = 0,
    .captureTime.endTime.minute   = 0,
    .captureTime.endTime.hour     = 15,
};

/* Function Prototypes */
void watchdog_esp32_on(void);
void watchdog_esp32_off(void);
void watchdog_send_bpacket_to_esp32(bpacket_t* bpacket);
void watchdog_send_bpacket_to_maple(bpacket_t* bpacket);
void watchdog_create_and_send_bpacket_to_esp32(uint8_t request, uint8_t code, uint8_t numBytes, uint8_t* data);
void watchdog_create_and_send_bpacket_to_maple(uint8_t request, uint8_t code, uint8_t numBytes, uint8_t* data);
uint8_t stm32_match_esp32_request(bpacket_t* bpacket);
uint8_t stm32_match_maple_request(bpacket_t* bpacket);
void process_watchdog_stm32_request(bpacket_t* bpacket);
void watchdog_report_error(uint8_t request, char* errorMsg);
void watchdog_report_success(uint8_t request);
void watchdog_print_wd_error(uint8_t result);
void watchdog_send_message_to_maple(char* string);

void bpacket_print(bpacket_t* bpacket) {
    char msg[BPACKET_BUFFER_LENGTH_BYTES + 2];
    sprintf(msg, "Receiver: %i Sender: %i Request: %i Code: %i Num bytes: %i", bpacket->receiver, bpacket->sender,
            bpacket->request, bpacket->code, bpacket->numBytes);
    log_message(msg);

    if (bpacket->numBytes > 0) {
        for (int i = 0; i < bpacket->numBytes; i++) {
            sprintf(msg, "%c", bpacket->bytes[i]);
            log_message(msg);
        }
    }
}

void watchdog_init(void) {

    log_clear();

    // Initialise all the peripherals
    ds18b20_init();     // Temperature sensor
    comms_stm32_init(); // Bpacket communications between Maple and EPS32

    // Set the datetime to 12am 1 January 2023
    datetime.date.year   = 23;
    datetime.date.month  = 2;
    datetime.date.day    = 10;
    datetime.time.hour   = 7;
    datetime.time.minute = 54;
    datetime.time.second = 0;
    stm32_rtc_write_datetime(&datetime);

    // Turn the ESP32 on
    watchdog_esp32_on();

    // Get the watchdog settings from the ESP32
    watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_GET_SETTINGS, BPACKET_CODE_EXECUTE, 0, NULL);
}

void watchdog_rtc_alarm_triggered(void) {
    state = S4_RECORD_DATA;
}

void watchdog_enter_state_machine(void) {

    while (1) {

        switch (state) {

            case S0_READ_WATCHDOG_SETTINGS:
                watchdog_send_message_to_maple("Reading watchdog settings\r\n");

                // Turn the watchdog on
                //                 watchdog_esp32_on();

                //                 // Create bpacket request to send to watchdog
                //                 watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_GET_SETTINGS,
                //                 BPACKET_CODE_EXECUTE, 0, NULL);

                //                 // Read from watchdog
                //                 while (comms_process_rxbuffer(ESP32_UART, &esp32Bpacket) != TRUE) {
                //                     continue;
                //                 }

                //                 uint8_t result = wd_bpacket_to_settings(&esp32Bpacket, &wdSettings);

                //                 if (result != TRUE) {
                // #ifdef DEBUG
                //                     watchdog_print_wd_error(result);
                // #endif
                //                     break;
                //                 }

                // Turn watchdog off
                // watchdog_esp32_off();

                state = S1_INIT_RTC;
                break;

            case S1_INIT_RTC:;
                watchdog_send_message_to_maple("Initialsing RTC\r\n");

                // Set the RTC time
                dt_datetime_t initDateTime;
                dt_date_init(&initDateTime.date, 1, 1, 2023);
                dt_time_init(&initDateTime.time, 0, 59, 8);
                stm32_rtc_write_datetime(&initDateTime);

                dt_datetime_t initAlarmDate;
                dt_date_init(&initAlarmDate.date, 1, 1, 2023);
                dt_time_init(&initAlarmDate.time, 0, 0, 9);
                stm32_rtc_set_alarmA(&initAlarmDate);

                state = S2_SET_ALARM;
                break;

            case S2_SET_ALARM:
                watchdog_send_message_to_maple("Setting alarm\r\n");

                // TODO: Set the alarm on the RTC

                // Check if there were any requests
                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state = S7_EXECUTE_REQUEST;
                } else {
                    state = S3_STM32_SLEEP;
                }

                break;

            case S3_STM32_SLEEP:
                if (sleeping != TRUE) {
                    watchdog_send_message_to_maple("Sleeping\r\n");
                    sleeping = TRUE;
                }

                // TODO: Set stm32 to sleep

                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state    = S7_EXECUTE_REQUEST;
                    sleeping = FALSE;
                    watchdog_send_message_to_maple("Waking up\r\n");
                }

                break;

