gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
                state = S6_CHECK_INCOMING_REQUEST;

                break;

            case S6_CHECK_INCOMING_REQUEST:
                watchdog_send_message_to_maple("Checking incoming requests\r\n");

                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state = S7_EXECUTE_REQUEST;
                } else {
                    state = S3_STM32_SLEEP;
                }

                break;

            case S7_EXECUTE_REQUEST:;
                watchdog_send_message_to_maple("Executing request\r\n");

                // Execute requests until none left
                uint32_t countDown = SysTick->VAL;

                while (1) {

                    // Process anything Maple sends to the STM32
                    if (comms_process_rxbuffer(BUFFER_2_ID, &mapleBpacket) == TRUE) {
                        if (stm32_match_maple_request(&mapleBpacket) != TRUE) {
                            process_watchdog_stm32_request(&mapleBpacket);
                        }

                        // Reset countdown timer
                        countDown = SysTick->VAL;
                    }

                    // Process anything the ESP32 sends to Maple
                    if (comms_process_rxbuffer(BUFFER_1_ID, &esp32Bpacket) == TRUE) {
                        if (stm32_match_esp32_request(&esp32Bpacket) != TRUE) {
                            process_watchdog_stm32_request(&esp32Bpacket);
                        }

                        // Reset countdown timer
                        countDown = SysTick->VAL;
                    }

                    if ((SysTick->VAL > countDown) && ((SysTick->VAL - countDown) > 5000)) {
                        break;
                    }

                    if ((SysTick->VAL < countDown) && ((countDown - SysTick->VAL) > 5000)) {
                        break;
                    }
                }

                state = S8_START_COUNT_DOWN;
                break;

            case S8_START_COUNT_DOWN:;
                watchdog_send_message_to_maple("Starting count down\r\n");

                uint32_t countDownEnd;
                uint8_t overflow1;
                if ((UINT_32_BIT_MAX_VALUE - SysTick->VAL) < COUNT_DOWN_TIME) {
                    countDownEnd = COUNT_DOWN_TIME - (UINT_32_BIT_MAX_VALUE - SysTick->VAL);
                } else {
                    countDownEnd = SysTick->VAL + COUNT_DOWN_TIME;
                }

                while ((SysTick->VAL <= countDownEnd) || (overflow1 == TRUE && countDownEnd < SysTick->VAL)) {

                    if (overflow1 == TRUE && countDownEnd <= SysTick->VAL) {
                        overflow1 = FALSE;
                    }

                    // Check if there is a command to process
                    while (comms_process_rxbuffer(MAPLE_UART, &mapleBpacket) != TRUE) {
                        continue;
                    }

                    state = S7_EXECUTE_REQUEST;
                    break;
                }

                if (state != S7_EXECUTE_REQUEST) {
                    state = S3_STM32_SLEEP;
                }

                break;

            default:
#ifdef DEBUG
                watchdog_report_error(state, "Invalid state found");
#endif
                break;
        }
    }
}

void watchdog_send_string(char* string) {

    // Loop through string
    uint32_t numBytes = chars_get_num_bytes(string);

    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;
    bpacket.request = BPACKET_CODE_IN_PROGRESS;

    int j = 0;
    for (int i = 0; i < numBytes; i++) {

        bpacket.bytes[j++] = (uint8_t)string[i];

        // Send bpacket if buffer is full or the end of the string
        // has been reached
        if (j == BPACKET_MAX_NUM_DATA_BYTES) {
            bpacket.numBytes = j;
            j                = 0;
            bpacket_to_buffer(&bpacket, &packetBuffer);
            comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
            continue;
        }

        if (i == (numBytes - 1)) {
            bpacket.numBytes = j;
            bpacket.request  = BPACKET_CODE_SUCCESS;
            bpacket_to_buffer(&bpacket, &packetBuffer);
            comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
        }
    }
}

/**
 * @brief Send message over uart to connected computer where the request is fail
 * and message is error message.
 *
 * @param errorMsg
 */
void watchdog_report_error(uint8_t request, char* errorMsg) {

    bpacket_t bpacket;
    uint8_t result = bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request,
                                       BPACKET_CODE_ERROR, errorMsg);

    if (result == TRUE) {
        bpacket_buffer_t packetBuffer;
        bpacket_to_buffer(&bpacket, &packetBuffer);

        comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
    } else {
        char msg[50];
        bpacket_get_error(result, msg);
        log_send_data(msg, sizeof(msg));
    }
}

void watchdog_report_success(uint8_t request) {

    bpacket_t bpacket;
    bpacket_create_p(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request, BPACKET_CODE_SUCCESS, 0, NULL);

    bpacket_buffer_t packetBuffer;
    bpacket_to_buffer(&bpacket, &packetBuffer);

    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_create_and_send_bpacket_to_maple(uint8_t request, uint8_t code, uint8_t numBytes, uint8_t* data) {
    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;
    bpacket_create_p(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request, code, numBytes, data);
    bpacket_to_buffer(&bpacket, &packetBuffer);
    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_create_and_send_bpacket_to_esp32(uint8_t request, uint8_t code, uint8_t numBytes, uint8_t* data) {
    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;
    bpacket_create_p(&bpacket, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32, request, code, numBytes, data);
    bpacket_to_buffer(&bpacket, &packetBuffer);
    comms_transmit(ESP32_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_send_message_to_maple(char* string) {

