gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    bpacket_t bpacket;
    bpacket_buffer_t packetBuffer;
    bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, BPACKET_GET_R_MESSAGE,
                      BPACKET_CODE_SUCCESS, string);
    bpacket_to_buffer(&bpacket, &packetBuffer);
    comms_transmit(MAPLE_UART, packetBuffer.buffer, packetBuffer.numBytes);
}

void watchdog_send_bpacket_to_esp32(bpacket_t* bpacket) {
    bpacket_buffer_t bpacketBuffer;
    bpacket_to_buffer(bpacket, &bpacketBuffer);
    comms_transmit(ESP32_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
}

void watchdog_send_bpacket_to_maple(bpacket_t* bpacket) {
    bpacket_buffer_t bpacketBuffer;
    bpacket_to_buffer(bpacket, &bpacketBuffer);
    comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
}

void process_watchdog_stm32_request(bpacket_t* bpacket) {

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_LED_RED_ON:
            watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_LED_RED_ON, BPACKET_CODE_EXECUTE, 0, NULL);
            break;

        case WATCHDOG_BPK_R_LED_RED_OFF:
            watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_LED_RED_OFF, BPACKET_CODE_EXECUTE, 0, NULL);
            break;

        case BPACKET_GEN_R_PING:;
            uint8_t ping = WATCHDOG_PING_CODE_STM32;
            watchdog_create_and_send_bpacket_to_maple(BPACKET_GEN_R_PING, BPACKET_CODE_SUCCESS, 1, &ping);
            break;

        case BPACKET_CODE_SUCCESS:
            watchdog_report_success(bpacket->request);
            break;

        case BPACKET_GET_R_MESSAGE:
            log_send_bdata(bpacket->bytes, bpacket->numBytes);
            break;

        default:
            watchdog_report_error(bpacket->request, "Unknown request");
    }
}

void watchdog_print_wd_error(uint8_t result) {
    char msg[40];
    wd_get_error(result, msg);
    log_error(msg);
}

uint8_t stm32_match_esp32_request(bpacket_t* bpacket) {

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // ESP32 Response to request from STM32 to take a photo

            if (bpacket->code == BPACKET_CODE_SUCCESS) { // Photo was succesfully taken

#ifdef DEBUG
                watchdog_report_success(WATCHDOG_BPK_R_TAKE_PHOTO);
#endif

                // Update RTC Alarm to next time

                break;
            }

            // If photo could not be taken, print error code to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_create_and_send_bpacket_to_maple(WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_ERROR,
                                                          bpacket->numBytes, bpacket->bytes);
                break;
            }

            break;

        case WATCHDOG_BPK_R_GET_SETTINGS:

            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                // // Store watchdog settings in struct
                uint8_t result = wd_bpacket_to_settings(bpacket, &wdSettings);

                if (result != TRUE) {
                    watchdog_print_wd_error(result);
                    break;
                }

                // // watchdog_report_success(WATCHDOG_BPK_R_GET_SETTINGS);

                char k[52];
                sprintf(k, "Cam res: %i Start time: %i %i End time: %i %i", wdSettings.cameraSettings.resolution,
                        wdSettings.captureTime.startTime.minute, wdSettings.captureTime.startTime.hour,
                        wdSettings.captureTime.endTime.minute, wdSettings.captureTime.endTime.hour);
                log_send_data(k, chars_get_num_bytes(k));
                break;
            }

            // If reading the watchdog settings fails, write the default watchdog
            // settings to the ESP32
            if (bpacket->code == BPACKET_CODE_ERROR) {

                watchdog_report_error(WATCHDOG_BPK_R_GET_SETTINGS, "Failed to read");

                bpacket_t settings;
                uint8_t result = wd_settings_to_bpacket(&settings, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32,
                                                        WATCHDOG_BPK_R_SET_SETTINGS, BPACKET_CODE_EXECUTE, &wdSettings);

                // Write camera settings to the esp32
                if (result == TRUE) {
                    watchdog_send_bpacket_to_esp32(&settings);
                    watchdog_report_error(WATCHDOG_BPK_R_GET_SETTINGS, "Wrote default settings");
                } else {
                    watchdog_report_error(WATCHDOG_BPK_R_GET_SETTINGS, "Failed to write default settings");
                }

                break;
            }

            break;

        case WATCHDOG_BPK_R_SET_SETTINGS:

            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                // watchdog_report_success(WATCHDOG_BPK_R_SET_SETTINGS);
                watchdog_report_error(WATCHDOG_BPK_R_GET_SETTINGS, "Set new settings");
                break;
            }

            // Log failure to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_report_error(WATCHDOG_BPK_R_SET_SETTINGS, "Failed to write settings to ESP32");
            }

            break;

        default:
            return FALSE;
    }

    return TRUE;
}

uint8_t stm32_match_maple_request(bpacket_t* bpacket) {

    bpacket_buffer_t bpacketBuffer;

    uint8_t request = bpacket->request;

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // Send command to ESP32 to take a photo

            // Record the current temperature
            if (ds18b20_read_temperature(DS18B20_SENSOR_ID_2) != TRUE) {
                watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to read temperature");
            }

            ds18b20_temp_t temp;
            if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_2, &temp) != TRUE) {
                watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to copy temperature");
            }

            // Update the datetime struct
            stm32_rtc_read_datetime(&datetime);

            // Get the real time clock time and date. Put it in a packet and send to the ESP32
            bpacket_t photoRequest;
            uint8_t result = wd_datetime_to_bpacket(&photoRequest, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32,
                                                    WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_EXECUTE, &datetime);

            if (result == TRUE) {
                watchdog_send_bpacket_to_esp32(&photoRequest);
            } else {
                watchdog_report_error(WATCHDOG_BPK_R_TAKE_PHOTO, "Failed to convert datetime to bpacket");
            }

            break;

        case WATCHDOG_BPK_R_GET_DATETIME:

            // Get the datetime from the RTC
            stm32_rtc_read_datetime(&datetime);
            if (wd_datetime_to_bpacket(bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request,
                                       BPACKET_CODE_SUCCESS, &datetime) == TRUE) {
                bpacket_to_buffer(bpacket, &bpacketBuffer);
                comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
            } else {
                watchdog_report_error(WATCHDOG_BPK_R_GET_DATETIME, "Failed to convert datetime to bpacket\0");
            }

            break;

        case WATCHDOG_BPK_R_SET_DATETIME:

