gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            // Set the datetime using the information from the bpacket
            if (wd_bpacket_to_datetime(bpacket, &datetime) == TRUE) {
                stm32_rtc_write_datetime(&datetime);
                watchdog_report_success(WATCHDOG_BPK_R_SET_DATETIME);
            } else {
                watchdog_report_error(WATCHDOG_BPK_R_SET_DATETIME, "Failed to convert bpacket to datetime\0");
            }

            break;

        case WATCHDOG_BPK_R_GET_CAMERA_RESOLUTION:;
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_SET_CAMERA_RESOLUTION:;
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_GET_STATUS:

            // TODO: Implement
            break;

        default:;
            return FALSE;
    }

    return TRUE;
}

void watchdog_update(void) {

    // Process anything the ESP32 sends to the STM32
    if (comms_process_rxbuffer(BUFFER_1_ID, &esp32Bpacket) == TRUE) {
        if (stm32_match_esp32_request(&esp32Bpacket) != TRUE) {
            process_watchdog_stm32_request(&esp32Bpacket);
        }
    }

    // Process anything Maple sends to the STM32
    if (comms_process_rxbuffer(BUFFER_2_ID, &mapleBpacket) == TRUE) {
        if (stm32_match_maple_request(&mapleBpacket) != TRUE) {
            process_watchdog_stm32_request(&mapleBpacket);
        }
    }
}

void watchdog_esp32_on(void) {
    ESP32_POWER_PORT->BSRR |= (0x01 << ESP32_POWER_PIN);

    // Delay for 1 second to let ESP32 startup
    HAL_Delay(1000);
}

void watchdog_esp32_off(void) {
    ESP32_POWER_PORT->BSRR |= (0x10000 << ESP32_POWER_PIN);
}